_posts_bak/2021-10-09-boj-1620.html
---
layout: post
title: BOJ 1620 나는야 포켓몬 마스터 이다솜
tags: STL
---

<div id="outline-container-org3c6d199" class="outline-2">
<h2 id="org3c6d199">BOJ 1620 나는야 포켓몬 마스터 이다솜</h2>
</div>

<div id="outline-container-org5e9edc5" class="outline-2">
<h2 id="org5e9edc5">접근하기</h2>
<div class="outline-text-2" id="text-org5e9edc5">
<ul class="org-ul">
<li>STL map key: string, value: int로 객체 이용</li>
<li>string 배열에 string을 각각 저장</li>
</ul>
</div>
</div>

<div id="outline-container-org61920a7" class="outline-2">
<h2 id="org61920a7">코드</h2>
<div class="outline-text-2" id="text-org61920a7">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #888a85;">// </span><span style="color: #888a85;">&#49884;&#44036;&#52488;&#44284; &#54400;&#51060;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;map&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;
<span style="color: #8ae234; font-weight: bold;">map</span> &lt;<span style="color: #8ae234; font-weight: bold;">string</span>, <span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">mp</span>;
<span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">sa</span>[1000010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;N, &amp;M);

    <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[21];
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);
        <span style="color: #8ae234; font-weight: bold;">string</span> <span style="color: #ff6347;">s</span>(str);
        mp[s] = (<span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span>)i+1;
        sa[i] = s;
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[21];
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);

        <span style="color: #729fcf; font-weight: bold;">if</span> (str[0] &gt;= <span style="color: #ad7fa8; font-style: italic;">'0'</span> &amp;&amp; str[0] &lt;= <span style="color: #ad7fa8; font-style: italic;">'9'</span>) {
            <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #8ae234; font-weight: bold;">long</span> <span style="color: #ff6347;">num</span> = 0;
            <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;str[j];j++) {
                num = num * 10 + (str[j] - <span style="color: #ad7fa8; font-style: italic;">'0'</span>);
            }
            printf(<span style="color: #ad7fa8; font-style: italic;">"%s\n"</span>, sa[num-1].c_str());
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, mp[str]);
        }
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2d3333a" class="outline-2">
<h2 id="org2d3333a">주의사항</h2>
<div class="outline-text-2" id="text-org2d3333a">
<ul class="org-ul">
<li>iostream으로 in/out을 하면 시간초과가 발생함.</li>
</ul>
</div>
</div>

<div id="outline-container-org91a6f5b" class="outline-2">
<h2 id="org91a6f5b">문제 링크</h2>
<div class="outline-text-2" id="text-org91a6f5b">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/1620">https://www.acmicpc.net/problem/1620</a></li>
</ul>
</div>
</div>
